Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱི་སྤྱན་སྔ་ན་ཡང་སྒྱུ་མ་མཁན་བཟང་པོ་བདག་ཉིད་ཕྱག་འཚལ་ནས་ཉེས་པ་འཆགས་པར་མཐོང་ཞིང་། དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོའི་མིག་ལམ་ན་གང་ཅུང་ཟད་ཅི་སྣང་བ་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པ་གཞན་ཅུང་ཟད་ཀྱང་མ་མཐོང་ནས་དེ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: And in front of every tathāgata, arhat, complete and perfect Buddha, Bhadra the illusionist saw himself bowing and confessing his faults, and wherever else Bhadra the illusionist looked, in every corner of his field of vision, he saw nothing but the Tathāgata.

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བར་གྱུར་ཏོ། །
en: He was utterly delighted and, rejoicing, became overjoyed and blissful.

source: དེ་དགའ་བ་དང་ཡིད་བདེ་བ་དེ་ཉིད་ཀྱིས་དད་པ་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ། །
en: Through that very feeling of joy and bliss, he attained the samādhi called recollecting the Buddha.

source: དེ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་མ་ཐག་ཏུ་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །བཞེད་ན་བརྒྱ་ཕྲག་སྟོང་ལས་ལྷག་གྱུར་ཅིང་། །དཔེར་ན་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །སངས་རྒྱས་མང་པོ་སྤྲུལ་པར་མཛད་པ་ཡི། །
en: As soon as he emerged from that samādhi, he joined his palms together and, seated before the Blessed One, spoke these verses: “I have been won over by the Tathāgata’s magical display, By which, if he wished, he could create A hundred thousand buddha emanations, Or as many as the grains of sand in the Ganges.

source: དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་དེ་ལ་མོས། །བདག་གིས་སྔོན་བསླབས་སྒྱུ་མའི་ས་མ་ལགས། །འཛམ་བུའི་གླིང་ན་བདག་འདྲ་མེད་སྙམ་ན། །དེ་རིང་རྒྱལ་བའི་རྫུ་འཕྲུལ་འདི་མཐོང་ནས། །འདི་ཡི་གྲངས་དང་ཆར་ཡང་མ་ཕོད་དོ། །
en: “I once thought that I was unequaled in Jambudvīpa In the level of my skill in illusions, But today, seeing this magical display of the Victorious One, My power does not approach a fraction of it.

source: བདག་གི་ཤ་ཡི་མིག་གིས་གང་མཐོང་བ། །ཐམས་ཅད་རྒྱལ་བའི་མཚན་གྱིས་བརྒྱན་པའི་སྐུ། །
en: “Looking with my eye of flesh, Everywhere I see the form of the Victorious One adorned with the marks.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ལ་ནི་འདི་དག་ཞུས། །རྒྱལ་བ་ཡང་དག་གང་ལགས་བཀའ་སྩོལ་ཅིག །
en: I beseech the king of Dharma— Please tell me, which is the real Victorious One?

source: གང་ཞིག་མཆོད་ན་ལེགས་པར་མཆོད་པ་ལགས། །
en: “By offering to which will the offering be best?

source: གང་ལ་འབྲས་བུ་ཆེན་པོར་འགྱུར་བ་ལགས། །
en: Which will lead to the greater result?

source: གང་གི་བྱང་ཆུབ་འཐུན་པར་གཟུང་བ་འདི། །
en: Holding to which will accord with awakening?

source: ཀུན་ཏུ་སྤྱན་གྱིས་བདག་ལ་བཀའ་སྩོལ་ཅིག །
en: Please tell me with your all-seeing vision!

source: དེ་རིང་འཇིག་རྟེན་མགོན་བགམ་བགྱིས་པ་ཡི། །ནོངས་པ་གང་ལགས་དེ་འདིར་ཀུན་ཏུ་འཆགས། །
en: “Today I confess my wrongdoing Of putting the guardian of the world to the test.

source: གང་དག་སེམས་ཅན་མཆོག་ལ་གུས་མི་གནས། །སེམས་ཅན་དེ་དག་རྒྱལ་བའི་བདེ་ལས་ཉམས། །
en: Those who do not show humility before the supreme being— Such beings forsake the bliss of the Victorious One.

source: བདག་ལ་ལྷ་དང་བརྒྱ་བྱིན་ཚངས་པ་དང་། །འཁོར་འདུས་གྱུར་པ་འདི་དག་ཀུན་གསོན་ཅིག །
en: “O gods, Śakra, Brahmā, And all who are assembled here, please listen to me!

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགྲོལ་སླད་དུ། །བྱང་ཆུབ་སེམས་ནི་བདག་གིས་བསྐྱེད་པར་བགྱི། །
en: In order to completely liberate all beings, I engender the mind of awakening.

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་འགྲོན་དུ་གཉེར། །བདུད་རྩི་བདེ་བས་ཡང་དག་ཚིམ་པར་བགྱི། །
en: “Treating all beings as my guests, I will satisfy them with blissful nectar.

source: གཉིད་ཀྱིས་རབ་ལོག་སེམས་ཅན་ཤེས་རབ་ཀྱི། །མཐུ་དང་སྒྲུབ་པས་རྣམ་པར་སད་པར་བགྱི། །
en: I will awaken those beings obstructed by sleep With the perfected power of insight.

source: རྣམ་པར་འཕྲུལ་པ་འདི་འདྲ་མཐོང་གྱུར་ཅིང་། །བདེ་བར་གཤེགས་བཀའ་ཡིད་འོང་ཡེ་ཤེས་དང་། །ཆགས་པ་མེད་པའི་སྤྱོད་མཆོག་ཐོས་ནས་ནི། །སུ་ཞིག་དག་པའི་རྒྱུ་སེམས་བསྐྱེད་མི་བགྱིད། །
en: “Who, upon seeing such a magical display And witnessing the Sugata’s delightful words and wisdom And his supreme conduct of nonattachment, Would not engender in mind the pure cause for awakening?

source: བྱང་ཆུབ་སེམས་མཁས་ཇི་ལྟར་སྤྱོད་པ་ཡི། །བྱང་ཆུབ་ལམ་ནི་བདག་ལ་བཤད་དུ་གསོལ། །
en: “Please explain to me the path to awakening As practiced by those who know the mind of awakening.

source: གང་ལ་ཉན་ཐོས་རྣམས་ཀྱིས་མི་དཔོགས་པའི། །དེ་དག་རྣམས་ཀྱི་སྤྱོད་པ་ཇི་ལྟ་བུ། །
en: What is the practice of bodhisattvas To which that of śrāvakas cannot be compared?

source: ཆོ་ག་སྤྱོད་པའི་ཡོན་ཏན་ཇི་ལྟ་བུ། །
en: “What are the good qualities of practicing its rites?

source: མཉན་པར་འདོད་ལ་གུས་པ་ཇི་ལྟ་བུ། །
en: What are the devotions of those who wish to hear the teachings?

source: ངེས་པ་རྣམས་ཀྱི་སྤྱོད་ལམ་ཅི་འདྲ་བ། །
en: What is the conduct of these graceful bodhisattvas?

source: བདག་ལ་ཐེ་ཚོམ་མ་མཆིས་དེ་བཞིན་གསུངས། །
en: Tell me, to still my doubts!

source: ཇི་ལྟར་ཐོས་པ་ཚོལ་ལ་གོམས་པ་ལགས། །
en: “How do they accustom themselves to seeking learning?

source: ཐོས་པ་སྙིང་པོར་བགྱིད་པའི་དང་པོ་གང་། །གཞན་ལ་གསལ་བར་སྟོན་པ་ཇི་ལྟ་བུ། །
en: How do they first fix this learning in their hearts Then teach it lucidly to others?

source: སྲོག་ཆགས་ཐམས་ཅད་ཇི་ལྟར་ཆོས་ལ་དད། །
en: How may all creatures come to have faith in the Dharma?

source: ཇི་ལྟར་འདི་དག་ཤེས་ཀྱི་ཁེ་མི་ཚོལ། །ཟང་ཟིང་མེད་པའི་སེམས་ལ་ཇི་ལྟར་གནས། །
en: “How do they become disinterested in profit And remain unattached to worldly concerns?

source: བྱས་པ་ཤེས་ཤིང་རབ་ཏུ་ཕན་འདོགས་དང་། །སེམས་ཅན་མི་ཕྱེད་གནས་པར་ཇི་ལྟར་འགྱུར། །
en: How do they become and remain grateful and helpful And inseparable from beings?

source: གྲོགས་པོ་གང་དག་བསྟེན་བགྱི་ཇི་ལྟ་བུ། །
en: “On what friends do they rely, and how do they rely on them?

source: སྡིག་པའི་གྲོགས་རྣམས་ཇི་ལྟར་རྣམ་པར་སྤོང་། །
en: How do they shun bad companions?

source: ཇི་ལྟར་སངས་རྒྱས་རྣམས་དང་ཕྲད་པར་འགྱུར། །
en: How do they meet with the buddhas?

source: དེ་དག་མཐོང་ནས་ཇི་ལྟར་མཆོད་པར་བགྱི། །
en: And having seen them, how do they make offerings?

source: ཇི་ལྟར་བསླབ་པ་དག་ལ་གུས་པ་ལགས། །དེ་ཡི་བསླབ་པ་བཅའ་བ་གང་ཞིག་ལགས། །
en: “How do they respect the pure trainings, And how do they commit to their trainings?

source: ཚུལ་ཁྲིམས་ཇི་ལྟར་རྣམ་པར་དག་པར་འགྱུར། །ཏིང་འཛིན་རྣམ་པར་དག་པ་ཇི་ལྟར་འཐོབ། །
en: How does their discipline become perfectly pure, And how do they obtain perfectly pure samādhi?

source: ཇི་ལྟར་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བ་ལགས། །ཚུལ་བཞིན་མ་ལགས་ཇི་ལྟར་སྤོང་བ་ལགས། །
en: “How do they adhere to what is proper And reject what is improper?

source: ཇི་ལྟར་ཤིན་ཏུ་ངེས་པར་བསམས་ཡིད་དང་། །ཉོན་མོངས་བདུད་ཀྱི་འཆིང་བས་མི་ཐུབ་ལགས། །
en: How do they maintain a resolute will And avoid being caught by the demonic fetters of affliction?

source: ཇི་ལྟར་དད་ལྡན་དོན་ནི་སེམས་བགྱིད་ཅིང་། །སེམས་ཀྱིས་སེམས་ཅན་རྣམས་ནི་མི་གཏོང་ལགས། །
en: “How do the faithful apply their minds to the ultimate Yet not abandon beings in their thoughts?

source: ཇི་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་བགྱིད་ཅིང་། །ནོར་མཆོག་འཛིན་པ་མེད་ལ་དཔའ་བ་ལགས། །
en: How do they bring beings to maturity While being heroic and without desiring exorbitant wealth?

source: ཇི་ལྟར་སེམས་ཅན་སྤྱོད་ལ་འཇུག་པ་དང་། །ཐབས་དང་བྱམས་པའི་སྙིང་རྗེ་གནས་པ་ལགས། །
en: “How do they engage in conduct for the sake of beings, Abiding in skillful means and loving compassion?

source: མངོན་པར་ཤེས་པ་ཇི་ལྟར་ཡོངས་རྫོགས་འགྱུར། །
en: How do they perfect the superknowledges?

source: དྲན་དང་བློ་གྲོས་གང་གིས་རྣམ་དག་ཅིང་། །
en: How do recollection and intellect become pure?

source: སོ་སོ་ཡང་དག་རིག་གཟུངས་བཟོད་པར་འགྱུར། །སྨོན་ལམ་རྣམ་དག་སྤྱོད་ལས་མི་ལྡོག་ཅིང་། །ཟབ་མོ་ཤེས་ལྡན་དོན་དམ་མཁས་པ་ལགས། །སྨོན་ལམ་ཐམས་ཅད་ཇི་ལྟར་འགྲུབ་པར་འགྱུར། །
en: “Those with correct discernment, retention, and tolerance Who never turn away from their aspirations and pure conduct, Who are wise to the profound and skilled in the ultimate truth— How do they accomplish all their aspirations?

source: ཇི་ལྟར་དེ་དག་ཕ་རོལ་ཕྱིན་འཕགས་ཤིང་། །དེ་བཞིན་བྱང་ཆུབ་རྗེས་སུ་འཐུན་པར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཤེས་ཤིང་། །བྱང་ཆུབ་ཕྱིར་ནི་སྤྱོད་པ་མི་ལྡོག་པ། །
en: “How are they in accord With awakening and the sublime perfections, Never turning back from bodhisattva conduct Always oriented toward omniscience and awakening?

source: ཀུན་མཁྱེན་ལེགས་པར་དོན་བསམས་ཤེས་རབ་མཚོ། །ཡེ་ཤེས་འབྱུང་གནས་འདི་ནི་བདག་ལ་གསུངས། །
en: “O omniscient one, who perfectly knows the truth, O ocean of insight, Source of wisdom, please teach this to me!

source: བཅོམ་ལྡན་ཕན་ཡོན་བདག་ལ་བསྟན་དུ་གསོལ། །བདག་གིས་ནན་ཏན་སྙིང་པོར་བགྱི་བར་འཚལ། །
en: Blessed One, please teach me these benefits, And I will earnestly practice from the bottom of my heart!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་སླར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། ཆོས་ཀུན་སྤྲུལ་པར་གང་གིས་ཤེས་པ་དེ། །སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་སྤྲུལ་པར་བྱེད། །སྤྲུལ་པ་དེ་དག་ཞིང་རྣམས་བྱེ་བར་འགྲོ། །དེ་དག་སོང་ནས་སེམས་ཅན་བྱེ་བ་འགྲེལ། །ཇི་ལྟར་བཟང་པོ་ཁྱོད་ཀྱིས་གཟུགས་མེད་ལས། །
en: The Blessed One responded to Bhadra the illusionist with these verses: “One who recognizes all phenomena as conjurations Can conjure ten billion buddhas; Those conjurations may go to millions of buddhafields And free millions of beings.

source: སྣ་ཚོགས་མཐའ་ཡས་གཟུགས་ནི་སྟོན་བྱེད་ཅིང་། །དེ་དག་སྐྱེ་བ་མེད་ཅིང་འགག་མེད་ལ། །འགྲོ་མེད་འོང་མེད་གནས་པ་མེད་པ་ལྟར། །བཟང་པོ་སྐྱེས་བུ་ཁྱུ་མཆོག་རྒྱལ་བ་ཡིས། །ཕུང་པོ་དགེ་འདུན་ཚོགས་བཅས་སྤྲུལ་དེ་འདྲ། །དེ་དང་ཡེ་ཤེས་མེད་པར་མི་འགྱུར་ཏེ། །སངས་རྒྱས་བསམ་ཡས་རྣམས་ཀྱི་རྫུ་འཕྲུལ་ཡིན། །
en: “Just as you, Bhadra, display from formlessness An infinite variety of forms That are unborn, unceasing, And without coming, going, and abiding, “In the same way, Bhadra, the foremost among beings, the Victorious One, Conjures his own aggregates along with his assembled saṅgha, Which are unborn and unceasing; Such is the magical display of the inconceivable buddhas.

source: ཇི་ལྟར་སྒྱུ་མས་རྨོངས་བྱས་སྐྱེ་བོ་ནི། །སེམས་པ་ཡོང་མིན་དེ་ལ་ང་རྒྱལ་མེད། །འདི་ལ་གྲུབ་པ་མེད་ཅིང་རྫས་ཡོད་མིན། །ཕྱིན་ཅི་ལོག་གི་སེམས་ཀྱིས་མཐོང་བ་ལྟར། །
en: “In the same way that a person deceived by an illusion Sees elephants, chariots, calvary, and infantry Although these are not constituted and have no substance, They are seen by the mistaken mind.

source: དེ་བཞིན་སངས་རྒྱས་གཟུགས་མེད་ཁ་དོག་དང་། །དབྱིབས་མིན་སྤྱོད་པ་སྟོན་ཡང་སྤྱོད་ལམ་མེད། །
en: “Similarly, buddhas are without form, color, and shape, And they exhibit neither activity nor behavior.

source: འཇིག་ཚོགས་ལྟ་བས་ཀུན་ནས་བསླང་མ་ཡིན། །སངས་རྒྱས་སངས་རྒྱས་སྙམ་དུ་འདུ་ཤེས་ཤིང་། །
en: The view of the transitory collection does not arise, And there is no notion of a buddha as a ‘buddha.’

source: སངས་རྒྱས་གཟུགས་སུ་མི་བལྟ་མཚན་དང་ནི། །ན་ཚོད་རིགས་སུ་མ་ཡིན་སྒྲ་དང་ནི། །
en: “Buddhas cannot be discerned by their physical form or marks, Their ages or lineages, or by their voices.

source: འཆད་པར་འགྱུར་བ་མ་ཡིན་སེམས་དང་ནི། །རྣམ་ཤེས་ཡིད་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མིན། །
en: Their mind cannot be explained, Nor their consciousness ascertained by intellect.

source: ཆོས་ཉིད་གང་ཡིན་སངས་རྒྱས་བཅོམ་ལྡན་འདས། །དུས་གསུམ་སྟོང་ཞིང་མཚན་ཡང་མ་སྐྱེས་པ། །
en: “Blessed buddhas, who are the true nature itself, Are empty of the three times; their marks are unborn.

source: རྟག་ཏུ་སྒྱུ་མའི་རང་བཞིན་རྣམ་པར་གྲོལ། །དེ་ལ་བགྲང་བས་རབ་ཏུ་ཕྱེ་བ་མེད། །
en: Eternally liberated from the illusory, Their phenomenality cannot be distinguished or calculated.

source: སངས་རྒྱས་འབྱུང་གང་ཆོས་ཉིད་འབྱུང་བ་མེད། །
en: “Whatever buddhas arise, their true nature has no arising.

source: དེ་ལ་ཕུང་པོ་ཡོད་མིན་ཁམས་མི་འབྱུང་། །ཆོས་དེ་གནས་པ་མི་གཡོ་སྟོན་པ་མེད། །
en: Their aggregates do not exist, and their constituents do not arise; Their phenomenality abides without fluctuating and without depending on anything.

source: དེ་ནི་མིག་ལྔའི་གནས་ཀྱང་མ་ཡིན་ནོ། །
en: They do not even abide as figments of the five eyes.

source: གང་ཞིག་བདག་གིས་སངས་རྒྱས་བལྟ་སྙམ་སེམས། །དེས་ནི་གཞར་ཡང་སངས་རྒྱས་མཐོང་མི་འགྱུར། །
en: “If someone thinks, ‘I have seen the Buddha,’ They have never really seen the Buddha.

source: འདྲེན་པ་མཐོང་བ་མེད་པ་མཐོང་བ་སྟེ། །དཔེར་ན་ནམ་མཁའ་ལ་ནི་བྱ་རྗེས་བཞིན། །
en: Seeing the unseen guide Is like seeing a bird’s trail in the sky.

source: བཟང་པོ་གང་ཁྱོད་ཅུང་ཟད་སངས་རྒྱས་ལྟ། །དེ་ཀུན་དོན་གཅིག་ཡིན་པར་ཤེས་པར་གྱིས། །
en: “Bhadra, the buddhas you saw just now— Know that they are all one and the same.

source: ང་དང་གཞན་གང་ཡིན་པ་དེ་ཀུན་མཚུངས། །བར་སྣང་མཐོང་དང་འདྲ་བར་མཉམ་པ་ཡིན། །དེ་དག་ཏིང་འཛིན་མཉམ་ཞིང་ཤེས་རབ་མཉམ། །དེ་དག་རྣམ་པར་གྲོལ་བར་མཉམ་པ་ཡིན། །
en: I and the others are all the same, Like the sameness one sees when gazing at the sky.

source: རྣམ་གྲོལ་ཡེ་ཤེས་མཐོང་དང་སྟོབས་དང་ནི། །རྒྱལ་བའི་ཡོན་ཏན་ཀུན་གྱིས་མཉམ་པ་ཡིན། །
en: “Their samādhi and insight are undifferentiated, Their liberation is undifferentiated, And their vision of liberating wisdom, their strengths, And all the qualities of the victorious ones are undifferentiated.

source: དེ་དག་སྟོང་དོན་གོ་འཕང་གནས་པར་མཉམ། །
en: “From the position of emptiness, they abide undifferentiated.

source: ཐམས་ཅད་ཆགས་པ་མེད་པའི་ཆོས་ཉིད་གནས། །
en: All of them abide in the true nature without attachment.

source: ཀུན་ཀྱང་སྒྱུ་མའི་རང་བཞིན་རྣམ་པར་གྲོལ། །དེ་དག་འབྱུང་བ་མེད་པར་འབྱུང་བ་ཡིན། །
en: They are all liberated from the illusory And appear without origin.

source: བཟང་པོ་རྒྱལ་བ་གཅིག་ལ་མཆོད་བྱེད་ན། །ཕྱོགས་བཅུའི་སངས་རྒྱས་ལ་ནི་མཆོད་འགྱུར་ཏེ། །
en: “Bhadra, if you make an offering to one of the victorious ones, That offering will have been made to all the buddhas of the ten directions.

source: འདི་ལྟར་དེ་དག་ང་ཡི་ཆོས་དབྱིངས་དང་། །ཐ་དད་བྱ་བ་ནམ་ཡང་ཡོད་མ་ཡིན། །
en: There has never been any difference Between their true expanse and my own.

source: དེ་དག་ཐམས་ཅད་ཡོན་བཞེས་སྦྱོང་བར་མཛད། །ཀུན་ལ་ཕུལ་བ་འང་འབྲས་བུ་ཆེ་བར་འགྱུར། །
en: “All of them purify gifts by accepting them; Offering to any of them yields the greatest result.

source: དེ་ཀུན་ཆོས་ཉིད་དག་པ་མཉམ་པ་བརྙེས། །སངས་རྒྱས་རྣམས་ལ་ཐ་དད་བྱ་བ་འང་མེད། །
en: They have all found the same pure true nature; In this way there is no distinction between buddhas.

source: རྒྱལ་བ་ཡང་དག་གང་ཡིན་བཤད་བྱ་ཡིས། །རྩེ་གཅིག་སེམས་དང་དྲན་པ་ཉེར་གཞག་ཅིང་། །ཆོས་ཚུལ་རྟོགས་པ་རྣམ་པར་ལྟ་བས་དེ། །
en: “Since I will tell you who is the real Victorious One, Examine and contemplate the way of Dharma With a single-pointed mind and closely applied mindfulness.

source: ལེགས་པར་ངེས་བསམས་སེམས་ཀྱིས་ང་ལས་ཉོན། །
en: Listen to me well, with a precisely focused mind!

source: བཟང་པོ་དེ་ཀུན་མ་བསྐྱེད་ཡང་དག་མིན། །ཕྱིན་ཅི་ལོག་གིས་དེ་ཀུན་མཐོང་བར་ཟད། །
en: “Bhadra, all of them are unproduced and unreal; Only the mistaken see them as real.

source: གལ་ཏེ་དངོས་པོའི་ངོ་བོ་ཡང་དག་ན། །དངོས་པོ་ཐམས་ཅད་དུ་ནི་ཟད་མི་འགྱུར། །
en: If the essence of things were truly real, Then all such things would not pass away.

source: དེ་ཕྱིར་ཤིན་ཏུ་མ་སྐྱེས་ཡང་དག་མིན། །དེ་དག་སྐྱེ་མེད་ཟད་ལ་གནས་པ་མེད། །
en: “Therefore, they are wholly unborn and unreal, And being unborn, they neither abide nor pass away.

source: དེས་ན་བལྟར་མེད་ངོ་བོ་དེ་དག་སྣང་། །རྣམ་པར་བལྟས་ན་གནས་པ་ཡོད་མ་ཡིན། །
en: So, though when unexamined they seem to be entities, When one looks thoroughly there is no abiding.

source: ཇི་ལྟར་བཟང་པོས་རྒྱལ་བ་མཐོང་བ་དང་། །ཇི་ལྟར་ཕྱོགས་སུ་མངོན་པར་སྤྲུལ་མཐོང་བ། །གང་གཞན་ཕུང་པོ་རྒྱ་ཆེན་རྟེན་སྟོབས་དང་། །ཕུང་པོ་ལྔ་པོ་འང་དེ་དང་འདྲ་བར་ལྟོས། །
en: “Just as you, Bhadra, see the victorious ones, And just as you see these conjurations in all directions, So should you regard the five aggregates, The vast aggregates on which the foolish rely.

source: ཆོས་རྣམས་ཐམས་ཅད་རང་བཞིན་མེད་པ་སྟེ། །སེམས་ཅན་དང་ནི་སངས་རྒྱས་མཚན་ཉིད་མེད། །
en: “All phenomena are without intrinsic nature, And beings are without the marks of a buddha.

source: མཚན་ཉིད་མེད་ལ་མཚན་དུ་འདོད་པ་དེ། །སངས་རྒྱས་ལས་ནི་ཤིན་ཏུ་རིང་བར་འགྱུར། །
en: Those who desire marks where there are none Are a long way from buddhahood.

source: ཆོས་ཡོད་མ་ཡིན་ཀུན་ཏུ་རྟོག་པས་བསླད། །
en: “Phenomena are nonexistent and arise due to conceptuality.

source: དངོས་པོ་མེད་པར་ཡང་ནི་བརྟེན་ནས་ཤེས། །
en: Know also that they are insubstantial and dependent.

source: བྱེད་པ་མེད་ཅིང་བྱེད་པ་པོ་ལས་འདས། །
en: They are without doing and beyond a doer.

source: མིང་དུ་འཛིན་པས་སྟོང་པ་རབ་ཏུ་སྟོན། །
en: By giving names, emptiness is taught.

source: གང་གིས་རྒྱུ་དང་བྱེད་པོ་རྐྱེན་མིན་ཤེས། །དེས་ནི་ཆགས་བྲལ་གྱུར་པའི་ཆོས་ཀྱང་ཤེས། །
en: “Those who know there are no causes or effectuating conditions Also know that phenomena are free of attachment.

source: འདོད་ཆགས་བྲལ་བའི་ཆོས་ནི་ཤེས་གྱུར་ན། །དེས་ནི་རྣམ་དག་མིག་གིས་སངས་རྒྱས་མཐོང་། །
en: If they know that phenomena are free of desire and attachment, They see the Buddha with the eye of complete purity.”

source: ཡང་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་དག་བརྗོད་དེ་བསྟན་པ་ན་སྒྱུ་མ་མཁན་བཟང་པོ་ཆོས་ལ་ངེས་པར་རྟོགས་པ་དང་འཐུན་པའི་བཟོད་པ་ཆུང་ངུ་སྐྱེས་སོ། །སྲོག་ཆགས་ལྔ་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་མ་བསྐྱེད་པ་སྐྱེས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When that teaching in verse had been given, Bhadra the illusionist attained the lesser acceptance that accords with certainty in the Dharma; five thousand beings engendered the mind of unsurpassed complete and perfect awakening, which until then had never occurred to them; and two hundred bodhisattvas obtained acceptance that phenomena are unborn.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་ཟས་སྤྲུལ་པ་དེ་གསོལ་ནས་སྒྱུ་མ་མཁན་བཟང་པོའི་ཡོན་ཡོངས་སུ་སྦྱང་བར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །གང་གིས་སྦྱིན་དང་གང་ལ་སྦྱིན། །སྦྱིན་པ་ཇི་ལྟར་མི་རྟོག་པ། །སྦྱིན་པ་མཉམ་པ་དེ་ཉིད་ནི། །བཟང་པོ་ལ་ནི་ཡོངས་རྫོགས་ཤོག །
en: Then the Blessed One partook of the conjured food, and in order to fully purify Bhadra’s gift, he spoke this verse: “Just as no discursive distinction is made between the giver, The receiver, and what is given, May this equal act of generosity Be fully perfected for Bhadra!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཁྱམས་འདི་རྒྱན་གྱིས་བརྒྱན་བཞིན་དུ་དགུང་བདུན་དུ་གནས་ཤིང་མི་གདའ་བར་མི་འགྱུར་བར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: Then Venerable Ānanda said to the Blessed One, “Blessed One, please grant your blessing that this courtyard, just as it is ornamented now, remains without disappearing or fading away for seven days.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་གྱི་ཁྱམས་དེ་ཇི་ལྟར་རྒྱན་གྱིས་བརྒྱན་བཞིན་དུ་ཞག་བདུན་དུ་གནས་ཤིང་མི་སྣང་བར་མི་འགྱུར་བར་བྱིན་གྱིས་བརླབ་པ་མཛད་དོ། །
en: The Blessed One then gave his blessing that the courtyard would remain, just as it was, and not disappear or vanish for a full seven days.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་ཏེ་གདན་ལས་བཞེངས་ནས་གཤེགས་སོ། །
en: Then the Blessed One rose from his seat and departed along with the saṅgha of monks.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་ཆོས་བསྟན་པའི་ཕྱིར་བཞུགས་སོ། །དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་། ཀླུ་དང་།
en: Later, when the Blessed One had arisen from his meditative composure and was seated in order to teach the Dharma, monks, bodhisattvas, gods, nāgas, yakṣas, and gandharvas approached the Blessed One to hear the Dharma.

source: གནོད་སྦྱིན་དང་། དྲི་ཟ་དེ་དག་ཀྱང་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་དོང་ངོ་། །དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ཡང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་གུས་པ་དང་བཅས།
en: Bhadra the illusionist also came before the Blessed One, bowed to his feet, and respectfully circumambulated him three times.

source: ཞེ་ས་དང་བཅས་པར་ཐལ་མོ་སྦྱར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: With proper honors he sat down to one side with his palms together.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་སྒྱུ་མ་མཁན་བཟང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ལམ་གང་ལ་ཞུགས་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་མཆི་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Thus seated to one side, Bhadra the illusionist said to the Blessed One, “Blessed One, please explain the path of the bodhisattvas, such that anyone who enters the path of bodhisattvas proceeds to the seat of awakening.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to Bhadra the illusionist, “Bhadra, listen well and keep this in mind.

source: བཟང་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: I will explain.”

source: སྒྱུ་མ་མཁན་བཟང་པོས་བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཉན་པ་དང་།
en: Bhadra the illusionist replied, “Very well!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: and listened as the Blessed One explained.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལམ་གང་ལ་ཞུགས་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཡིན་ཏེ།
en: “Bhadra, these four constitute the path of the bodhisattvas, such that anyone who enters the path of bodhisattvas will proceed to the seat of awakening.

source: བཞི་གང་ཞེ་ན།
en: What are the four?

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་མི་འདོར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་མི་གཏོང་བ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཚོལ་བ་ལ་ངོམས་མི་ཤེས་པ་ཉིད་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པ་སྟེ།
en: Not abandoning the mind of omniscience, not forsaking beings, being insatiable in seeking out all roots of virtue, and endeavoring to be diligent in protecting the holy Dharma.

source: བཟང་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལམ་གང་ལ་ཞུགས་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཡིན་ནོ། །
en: Bhadra, these four constitute the path of bodhisattvas, such that anyone who enters the path of bodhisattvas will proceed to the seat of awakening.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: “Bhadra, these four constitute the completely pure conduct of bodhisattvas.

source: སྡོམ་པ་གསུམ་ཡོངས་སུ་དག་པ་དང་། གནས་ཡོངས་སུ་དག་པ་དང་། ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། སྐྱེ་བ་ཡོངས་སུ་དག་པ་སྟེ།
en: Purity of the three vows, purity of intention, purity of knowledge, and purity of birth.

source: བཞི་པོ་དེ་དག་ཡིན་ནོ། །
en: These are the four.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་གང་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གཏིང་མི་དཔོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡིན་ཏེ།
en: “Bhadra, these four constitute the bodhisattva qualities that śrāvakas and pratyekabuddhas cannot fathom.

source: བསམ་གཏན་ཟློག་པ་དང་། སེམས་ཀྱིས་རྣམ་པར་འབྱེད་པ་དང་། སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེ་བ་དང་། སྤོབས་པ་དང་། སྐད་སྣ་ཚོགས་པ་ཉིད་དེ།
en: Emerging from concentration, mental discernment, great compassion for beings, and inspired speech in diverse languages.

source: བཟང་པོ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཕགས་པའི་སྤྱོད་པ་ཡིན་ཏེ།
en: “Bhadra, these four constitute the superior conduct of bodhisattvas.

source: དགོན་པ་ན་གནས་པ་དང་། འདུ་འཛི་ལ་མི་དགའ་བ་དང་། དེ་ན་གནས་ན་སེམས་ཅན་རྣམས་ལ་བྱམས་པ་དང་། འདུ་བྱེད་རྣམས་གང་ནས་ཀྱང་མི་འོང་།
en: Staying in remote places, not taking delight in distraction, being kind to beings when staying in such places, and knowing that all conditioned factors neither come from nor go anywhere.

source: གང་དུ་ཡང་མི་འགྲོ་བར་ཤེས་པ་སྟེ་བཞི་པོ་དེ་དག་ཡིན་ནོ། །
en: These are the four.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྲི་ཞུ་ཆེ་ཞིང་གུས་པ་ལ་གནས་པ་ཞེས་བརྗོད་པར་བྱ་སྟེ།
en: “Bhadra, when bodhisattvas have these four qualities, they may be considered objects of great praise and respect.

source: བྱང་ཆུབ་སེམས་དཔའ་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་། སེམས་རྟག་ཏུ་དགའ་བ་དང་། ང་རྒྱལ་དང་། དྲེགས་པ་སྤང་བ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་སྒྲུབ་པ་སྟེ།
en: Bodhisattvas not being concerned with their own bodies or lives, always being joyful in spirit, abandoning pride and haughtiness, and accomplishing what they have said they will do.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have these four qualities, their conduct is perfect.

source: དུས་ཤེས་པ་དང་། ཚོད་ཤེས་པ་དང་། རབ་ཏུ་དབེན་པ་དང་།
en: Knowing the proper time and knowing the right measure, solitude, and authenticity.

source: ཡང་དག་པ་ཉིད་དེ་བཞི་པོ་དེ་དག་ཡིན་ནོ། །
en: These are the four.

source: བཟང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཐེ་ཚོམ་མེད་པ་ཡིན་ཏེ།
en: “Bhadra, when bodhisattvas have these four qualities, they are without doubt.
